### Terraform Plan
```
cloudflare_d1_database.db: Refreshing state... [id=48e8a415-9f80-4556-98c6-8aa283a0b7ab]
cloudflare_r2_bucket.storage: Refreshing state... [id=gdgoc-wiki-production-storage]
cloudflare_queue.translation_jobs: Refreshing state... [id=2d1c69fc16e7456d8c3efd819510cc05]
cloudflare_pages_project.app: Refreshing state... [id=gdgoc-wiki-production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_d1_database.db must be replaced
-/+ resource "cloudflare_d1_database" "db" {
      ~ id         = "48e8a415-9f80-4556-98c6-8aa283a0b7ab" -> (known after apply)
      ~ name       = "gdgoc-wiki-production-db" -> "gdgoc-wiki-staging-db" # forces replacement
      ~ version    = "production" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # cloudflare_pages_project.app must be replaced
-/+ resource "cloudflare_pages_project" "app" {
      ~ created_on        = "2026-03-03T16:03:46Z" -> (known after apply)
      ~ domains           = [
          - "gdgoc-wiki-production.pages.dev",
        ] -> (known after apply)
      ~ id                = "gdgoc-wiki-production" -> (known after apply)
      ~ name              = "gdgoc-wiki-production" -> "gdgoc-wiki-staging"
      ~ subdomain         = "gdgoc-wiki-production.pages.dev" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ deployment_configs (known after apply)
      - deployment_configs {
          - preview {
              - always_use_latest_compatibility_date = false -> null
              - compatibility_date                   = "2026-03-03" -> null
              - compatibility_flags                  = [] -> null
              - d1_databases                         = {} -> null
              - durable_object_namespaces            = {} -> null
              - environment_variables                = {} -> null
              - fail_open                            = false -> null
              - kv_namespaces                        = {} -> null
              - r2_buckets                           = {} -> null
              - secrets                              = (sensitive value) -> null
              - usage_model                          = "standard" -> null
            }
          - production {
              - always_use_latest_compatibility_date = false -> null
              - compatibility_date                   = "2026-03-03" -> null
              - compatibility_flags                  = [] -> null
              - d1_databases                         = {} -> null
              - durable_object_namespaces            = {} -> null
              - environment_variables                = {} -> null
              - fail_open                            = false -> null
              - kv_namespaces                        = {} -> null
              - r2_buckets                           = {} -> null
              - secrets                              = (sensitive value) -> null
              - usage_model                          = "standard" -> null
            }
        }

      + source {
          + type = "github"

          + config {
              + deployments_enabled           = true
              + owner                         = "gdgoc-jp" # forces replacement
              + pr_comments_enabled           = true
              + preview_branch_excludes       = [
                  + "main",
                ]
              + preview_branch_includes       = [
                  + "*",
                ]
              + preview_deployment_setting    = "custom"
              + production_branch             = "main"
              + production_deployment_enabled = true
              + repo_name                     = "wiki" # forces replacement
            }
        }

        # (1 unchanged block hidden)
    }

  # cloudflare_queue.translation_jobs will be updated in-place
  ~ resource "cloudflare_queue" "translation_jobs" {
        id         = "2d1c69fc16e7456d8c3efd819510cc05"
      ~ name       = "gdgoc-wiki-production-translation-jobs" -> "gdgoc-wiki-staging-translation-jobs"
        # (1 unchanged attribute hidden)
    }

  # cloudflare_r2_bucket.storage must be replaced
-/+ resource "cloudflare_r2_bucket" "storage" {
      ~ id         = "gdgoc-wiki-production-storage" -> (known after apply)
      ~ name       = "gdgoc-wiki-production-storage" -> "gdgoc-wiki-staging-storage" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ d1_database_id     = "48e8a415-9f80-4556-98c6-8aa283a0b7ab" -> (known after apply)
  ~ d1_database_name   = "gdgoc-wiki-production-db" -> "gdgoc-wiki-staging-db"
  ~ pages_project_name = "gdgoc-wiki-production" -> "gdgoc-wiki-staging"
  ~ queue_name         = "gdgoc-wiki-production-translation-jobs" -> "gdgoc-wiki-staging-translation-jobs"
  ~ r2_bucket_name     = "gdgoc-wiki-production-storage" -> "gdgoc-wiki-staging-storage"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```